-- Создание базы данных для системы репертуарных афиш театра

CREATE DATABASE IF NOT EXISTS avo_zaze CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;

USE avo_zaze;

/*M!999999\- enable the sandbox mode */
-- MariaDB dump 10.19  Distrib 10.11.14-MariaDB, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: avo_zaze
-- ------------------------------------------------------
-- Server version	10.11.14-MariaDB-0+deb12u2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `play_templates`
--

DROP TABLE IF EXISTS `play_templates`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8mb4 */;
CREATE TABLE `play_templates` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `play_id` int(11) NOT NULL,
  `template_text` text NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `play_id` (`play_id`),
  CONSTRAINT `play_templates_ibfk_1` FOREIGN KEY (`play_id`) REFERENCES `plays` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `play_templates`
--

LOCK TABLES `play_templates` WRITE;
/*!40000 ALTER TABLE `play_templates` DISABLE KEYS */;
INSERT INTO `play_templates` VALUES
(1,1,'==В ролях:==\n\'\'СОСТАВ УТОЧНЯЕТСЯ\'\'\n\n\'\'\'[https://www.zazerkal.spb.ru/tickets/{CODE}.htm|КУПИТЬ БИЛЕТ]\'\'\'','2025-09-07 02:43:46','2025-09-07 02:43:46');
/*!40000 ALTER TABLE `play_templates` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `plays`
--

DROP TABLE IF EXISTS `plays`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8mb4 */;
CREATE TABLE `plays` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `short_name` varchar(50) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `wiki_link` varchar(255) DEFAULT NULL,
  `hall` varchar(100) NOT NULL,
  `special_mark` varchar(100) DEFAULT '',
  `is_subscription` tinyint(1) DEFAULT 0,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `short_name` (`short_name`),
  KEY `idx_plays_short_name` (`short_name`)
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `plays`
--

LOCK TABLES `plays` WRITE;
/*!40000 ALTER TABLE `plays` DISABLE KEYS */;
INSERT INTO `plays` VALUES
(1,'Тоска','[[Тоска]]','Тоска','Большой зал','ПРЕМЬЕРА!',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(2,'Летучка','[[Летучая_мышь|Летучая мышь]]','Летучая_мышь','Большой зал','',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(3,'Любимая','[[Любимая_игрушка|Любимая игрушка]]','Любимая_игрушка','Белый зал','',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(4,'СП','[[Синяя_птица|Синяя птица]]','Синяя_птица','Большой зал','',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(5,'Теремок','[[Теремок]]','Теремок','Белый зал','',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(6,'Порги','[[Порги_и_Бесс|Порги и Бесс]]','Порги_и_Бесс','Большой зал','',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(7,'Клык','[[Белый_Клык|Белый Клык]]','Белый_Клык','Большой зал','',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(8,'Свиньи','[[Три_поросёнка|Три поросёнка]]','Три_поросёнка','Белый зал','',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(9,'Салтан','[[Сказка_о_царе_Салтане|Сказка о царе Салтане]]','Сказка_о_царе_Салтане','Большой зал','',0,'2025-09-07 02:43:46','2025-09-07 02:43:46'),
(10,'Апельсины','[[Три_апельсина|Три апельсина]]','Три_апельсина','Белый зал','',1,'2025-09-07 02:43:46','2025-09-07 03:06:18'),
(11,'Вайль','[[Курт_Вайль._Игра_в_классики|Курт Вайль. Игра в классики]]','Курт_Вайль._Игра_в_классики','Большой зал','ПРЕМЬЕРА!',0,'2025-09-07 02:48:53','2025-09-07 02:48:53'),
(12,'Кукареку','[[Ку-ка-ре-ку!]]','Ку-ка-ре-ку!','Белый зал','',0,'2025-09-07 02:49:33','2025-09-07 02:49:33'),
(13,'Декамерон','[[Декамерон]]','Декамерон','Большой зал','',0,'2025-09-07 02:50:00','2025-09-07 02:50:00'),
(14,'Хоттабыч','[[Старик_Хоттабыч|Старик Хоттабыч]]','Старик_Хоттабыч','Большой зал','',0,'2025-09-07 02:50:45','2025-09-07 02:50:45'),
(15,'Альбом','[[Детский_альбом|Детский альбом]]','Детский_альбом','Большой зал','',0,'2025-09-07 02:51:36','2025-09-07 02:51:36'),
(16,'Крокодил','[[Крокодил]]','Крокодил','Белый зал','',0,'2025-09-07 02:57:12','2025-09-07 02:57:12'),
(17,'Онегин','[[Евгений_Онегин|Евгений Онегин]]','Евгений_Онегин','Большой зал','',0,'2025-09-07 02:57:49','2025-09-07 02:57:49'),
(18,'Письма','[[Военные_письма|Военные письма]]','Военные_письма','Большой зал','ПРЕМЬЕРА!',0,'2025-09-07 02:58:26','2025-09-07 02:58:26'),
(19,'Каша','[[Мишкина_каша|Мишкина каша]]','Мишкина_каша','Белый зал','',0,'2025-09-07 02:58:48','2025-09-07 02:58:48'),
(20,'Пиковая','[[Пиковая_дама|Пиковая дама]]','Пиковая_дама','Большой зал','',0,'2025-09-07 02:59:18','2025-09-07 02:59:18'),
(21,'Рикки','[[Сказание_о_Рикки-Тикки-Тави|Сказание о Рикки-Тикки-Тави]]','Сказание_о_Рикки-Тикки-Тави','Белый зал','',0,'2025-09-07 03:00:45','2025-09-07 03:00:45'),
(22,'Спящая','[[Спящая_красавица|Спящая красавица]]','Спящая_красавица','Белый зал','',0,'2025-09-07 03:01:13','2025-09-07 03:01:13'),
(23,'Любовный','[[Любовный_напиток|Любовный напиток]]','Любовный_напиток','Большой зал','',0,'2025-09-07 03:01:47','2025-09-07 03:01:47'),
(24,'Напиток','[[Любовный_напиток|Любовный напиток]]','Любовный_напиток','Большой зал','',0,'2025-09-07 03:02:14','2025-09-07 03:02:14'),
(25,'Муравей','[[Путешествие_муравьишки|Путешествие муравьишки, или От рассвета до заката]]','Путешествие_муравьишки','Большой зал','',0,'2025-09-07 03:02:44','2025-09-07 03:02:44'),
(26,'Баттерфляй','[[Мадам_Баттерфляй|Мадам Баттерфляй]]','Мадам_Баттерфляй','Большой зал','',0,'2025-09-07 03:03:07','2025-09-07 03:03:07'),
(27,'Незнайка','[[Приключения_Незнайки|Приключения Незнайки]]','Приключения_Незнайки','Большой зал','',0,'2025-09-07 03:03:41','2025-09-07 03:03:41'),
(28,'Чехов','[[Чехов._В_Рождественскую_ночь|Чехов. В Рождественскую ночь]]','Чехов','Большой зал','',0,'2025-09-07 03:04:24','2025-09-07 03:04:24'),
(29,'5б','[[Что_случилось_в_5_«Б»|Что случилось в 5 «Б»?]]','Что_случилось_в_5_«Б»','Белый зал','',0,'2025-09-07 03:06:07','2025-09-07 03:06:07'),
(30,'Франц','[[Французский_дворик|Французский дворик]]','Французский_дворик','Двор театра «Зазеркалье»','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(31,'Ленинг','[[Ленинградский_дворик|Ленинградский дворик]]','Ленинградский_дворик','Двор театра «Зазеркалье»','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(32,'Итальянский','[[Итальянский_дворик|Итальянский дворик]]','Итальянский_дворик','Двор театра «Зазеркалье»','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(33,'Концерт','[[Камерный_концерт|Камерный концерт]]','Камерный_концерт','Белый зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(34,'Скрипач','[[Вечер_еврейской_музыки|Вечер еврейской музыки]]','Вечер_еврейской_музыки','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(35,'Дирижёр','[[Дирижёр_-_Дед_Мороз|Дирижёр — Дед Мороз]]','Дирижёр_-_Дед_Мороз','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(36,'Фейерверк','[[Новогодний_музыкальный_фейерверк|Новогодний музыкальный фейерверк]]','Новогодний_музыкальный_фейерверк','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(37,'Сказка','[[Сказка_о_Соловье,_Императоре_и_Смерти|Сказка о Соловье, Императоре и Смерти]]','Сказка_о_Соловье,_Императоре_и_Смерти','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(38,'Финист','[[Финист_Ясный_Сокол|Финист Ясный Сокол]]','Финист_Ясный_Сокол','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(39,'Крошечка','[[Крошечка-Хаврошечка]]','Крошечка-Хаврошечка','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(40,'Робинзон','[[Робинзон_Крузо|Робинзон Крузо]]','Робинзон_Крузо','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(41,'Свинопас','[[Свинопас]]','Свинопас','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(42,'Алиса','[[Алиса_в_Зазеркалье|Алиса в Зазеркалье]]','Алиса_в_Зазеркалье','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(43,'Петя','[[Петя_и_волк|Петя и волк]]','Петя_и_волк','Белый зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(44,'Дюймовочка','[[Дюймовочка]]','Дюймовочка','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(45,'Снегурочка','[[Снегурочка]]','Снегурочка','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(46,'Не_страшен','[[Нам_не_страшен_Новый_год!|Нам не страшен Новый Год!]]','Нам_не_страшен_Новый_год!','Белый зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(47,'Квест','[[Квест_Деда_Мороза|Квест Деда Мороза]]','Квест_Деда_Мороза','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(48,'Кармен','[[Кармен]]','Кармен','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(49,'Флейта','[[Волшебная_флейта|Волшебная флейта]]','Волшебная_флейта','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(50,'Царская','[[Царская_невеста|Царская невеста]]','Царская_невеста','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(51,'Гиперболоид','[[Гиперболоид_инженера_Гарина|Гиперболоид инженера Гарина]]','Гиперболоид_инженера_Гарина','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(52,'Айболит','[[Ай!_Болит!|Ай! Болит!]]','Ай!_Болит!','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(53,'Отелло','[[Отелло]]','Отелло','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(54,'Золушка','[[Золушка]]','Золушка','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23'),
(55,'Иоланта','[[Иоланта]]','Иоланта','Большой зал','',0,'2025-09-07 06:54:23','2025-09-07 06:54:23');
/*!40000 ALTER TABLE `plays` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `repertoire_history`
--

DROP TABLE IF EXISTS `repertoire_history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8mb4 */;
CREATE TABLE `repertoire_history` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `month_year` varchar(50) NOT NULL,
  `source_text` text NOT NULL,
  `result_wiki` text NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `idx_repertoire_history_month_year` (`month_year`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `repertoire_history`
--

LOCK TABLES `repertoire_history` WRITE;
/*!40000 ALTER TABLE `repertoire_history` DISABLE KEYS */;
/*!40000 ALTER TABLE `repertoire_history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES
(1,'osokin','$2y$10$BJGif4Gg97vyfY8dJdt44Oue.rN3WxDFrWxq/4mHb7uTwRXKWgeZW','2025-09-07 02:43:46');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-09-07  6:37:41
